Repository: brutalcode/razborkabmw
Catalog: sites/all/modules/views_hst_filter/translations/views_hst_filter.*.po
Languages: ru

source: Content
ru: Содержимое

source: Has a taxonomy term (with the hierarchy)
ru: Термины таксономии с иерархией

source: Display content if it has the selected taxonomy terms, or children of the selected terms. Filter consist of the dynamic related fields of selection (one field for each level of vocabulary) which are worked through Ajax.
ru: Вывод содержимого, привязанного к выбранному термину таксономии или его дочерним терминам. Фильтр предоставляет отдельные поля для каждого уровня иерархии, работающие через Ajax.

source: vocabulary is
ru: словарь

source: Label
ru: Метка

source: Vocabulary
ru: Словарь

source: Select which vocabulary to show terms for in the regular options.
ru: Выберите словарь, из которого будете выбирать термины.

source: Limit depth for
ru: Ограничить глубину

source: The max depth of level of taxonomy term available for selection of user. If 0 will no limit.
ru: Максимальный уровень термина таксономии, доступный пользователю для выбора. Если устанавлен в 0, то уровень не ограничивается.

source: Add nodes counter to each term
ru: Добавить счетчик нод

source: If checked to each item in select box will be added counter of related nodes. A bit of slower than without it.
ru: Если отмечено, к каждому термину в списках выбора будет добавлено количество отмеченных им нод. Снижает скорость работы фильтра.

source: Hide empty terms
ru: Скрывать термины без нод

source: If checked the terms without related nodes will not added to select box. A bit of slower than without it.
ru: Если отмечено, термины, у которых нет привязанных нод не будут доступны для выбора. Снижает скорость работы фильтра.

source: Inline wrapper
ru: Вывод полей в линию

source: If checked to each select box will be added class 'container-inline'.
ru: Если отмечено, поля будут выводится в линию. В противном случае - один под другим.

source: <Any>
ru: <Любой>

source: - Any -
ru: - Любой -

source: The filter with hierarchical select of taxonomy terms.
ru: Фильтр с иерархическим выбором терминов таксономии.

source: Views
ru: Представления
